# 1
num1 = 10
num2 = 20

# შედარების ოპერატორების გამოყენებით
print(f"{num1} < {num2}: {num1 < num2}")   # True
print(f"{num1} > {num2}: {num1 > num2}")   # False
print(f"{num1} <= {num2}: {num1 <= num2}") # True
print(f"{num1} >= {num2}: {num1 >= num2}") # False
print(f"{num1} != {num2}: {num1 != num2}") # True
print(f"{num1} == {num2}: {num1 == num2}") # False

# 2
# ორი ციფრის შემოტანა მომხმარებლისგან
num1 = int(input("შეიტანეთ პირველი ციფრი: "))
num2 = int(input("შეიტანეთ მეორე ციფრი: "))

# შედარება და შედეგების გამოყვანა
print(f"{num1} < {num2}: {num1 < num2}")
print(f"{num1} > {num2}: {num1 > num2}")
print(f"{num1} == {num2}: {num1 == num2}")
print(f"{num1} != {num2}: {num1 != num2}")

# 3
# == (თანაბრობა): ამ ოპერატორის გამოყენებით ხდება ობიექტების ერთმანეთთან ტოლობის შემოწმება. მაგალითად, 5 == 5 დაბრუნებს true, რადგან ორივე მნიშვნელობა ტოლია.

# != (არატოლობა): ეს ოპერატორი გამოიყენება იმის შესამოწმებლად, რომ ობიექტები ერთმანეთისგან განსხვავებულია. მაგალითად, 5 != 4 დაბრუნებს true, რადგან 5 და 4 არ არის ტოლი.

# > (მეტია): ამ ოპერატორის გამოყენებით ხდება ობიექტის შემოწმება, თუ ის მეორე ობიექტზე მეტია. მაგალითად, 5 > 3 დაბრუნებს true, რადგან 5 მეტია 3-ზე.

# < (ნაკლებია): ეს ოპერატორი გამოიყენება იმის შესამოწმებლად, თუ ობიექტი მეორე ობიექტზე ნაკლებია. მაგალითად, 3 < 5 დაბრუნებს true, რადგან 3 ნაკლებია 5-ზე.

# >= (მეტი ან ტოლი): ამ ოპერატორის გამოყენებით ხდება ობიექტის შემოწმება, თუ ის მეორე ობიექტზე მეტია ან ტოლია. მაგალითად, 5 >= 5 დაბრუნებს true, რადგან 5 ტოლია 5-ს.

# <= (ნაკლები ან ტოლი): ეს ოპერატორი გამოიყენება იმის შესამოწმებლად, თუ ობიექტი მეორე ობიექტზე ნაკლებია ან ტოლია. მაგალითად, 3 <= 5 დაბრუნებს true, რადგან 3 ნაკლებია 5-ზე.