
//2) ახსენით რას შვება ეს მეთოდები:
//Math.round()
//Math.floor()
//Math.ceil()
//Math.random() 
//და დაწერეთ ამ მეთოდებზე თითო მაგალითი


//Math.round() - ეს ამრგავლებს უახლოეს მთელ რიცხვამდე.  
//Math.floor() - ეს ამ გვალებს რაც არის რიცხვის ქვეოთ. 
//Math.ceil() - ეს კი ამრგვალებს რაც არის რიცხვის ზემოთ.
//Math.random() - ეს კი შემთხვევითობის პრინციპით ამოაგდებს 0 ან 1-ს თუ დავუწერთ *100(ანუ გამრავლებას და 100-ს.) და ისე კი ნებისმიერ 1ის ქვევით ყველა ათწილადს.

//გალალითები

console.log(math.round(3.4))
console.log(math.floor(5.6))
console.log(math.ceil(2.2))
console.log(math.random)