# ```შემოიტანეთ 2 ცვლადი რომლებშიც შეინახავთ int და შემდომში დაუმატეთ ერთმანეთს```
# ```შემოიტანეთ 3 ცვლადი და შემდგომში დაპრინტეთ ტერმინალში ერთში შეინახეთ თქვენი ასასკი მეორეში თქვენი წონა და მესამეში თქვენი სიმაღლე```
# ```დაუმატეთ ერთმანეთს თქვენი 2 საყვარელი ფილმის სახელი```
# ```შემოიტანეთ 10 ცვლადი სადაც შეინახავთ მთელ რიცხვებს```
# ```შემოიტანეთ 10 ცვლადი სადაც შეინახავთ ათწილად/წერტილიან რიცხვებს```
# ```შემოიტანეთ 10 ცვლადი სადაც შეინახავთ ტექსტს და ბრჭყალებიან რიცხვებს```


#დავალება პირველი

a = 2
b = 7
print(a + b)



#დავალება მეორე

age = 11
weight = 43
height = 1.53
print(age , weight , height)



# დავალება მესამე

movie1 = "ჯარისკაცის "
movie2 = "წუნა და წრუწუნა" 
print(movie1 + movie2)


# დავალება მეოთხე

a = 11
b = 12
c = 44
d = 66
e = 90
f = 22
g = 54
h = 43
i = 55
j = 77


 # დავალება მეხუთე


a = 1.1
b = 1.4
c = 5.5
d = 888.5
e = 77.9
f = 6.6
g = 77.9
h = 5.6
i = 8.8
j = 66.99


 # დავალება მეექვსე 


a = "მე ვარ გიორგი 11 წლის"
b = "მე ვარ 1.53 სიმაღლეში"
c = "მე ვსწავლობ 6 კლასში"
d = "მე ვცხოვრობ 2 სართულზე"
e = "მე მაქ samsung galax A 32"
f = "მე გოაში ვარ 22 LEVELI"
g = "მე ამ კოდს ვწერ 5:22 საათზე"
h = "მე მათემატიკაში მივიღე 8 ქულა"
i = "მე ქობულეთში ვიყავი 7 დღე"
j = "მე ამ კოდს ვწერ დღე 5 ში"