# <img src="image.png">
# ეს ნიშნავს რომ image.png ეძებს იმავე საქახალდეს, სადაც html ფაილი არის. მაგ: თუ ჩვენი გვერდი არის /site/index.html მაშინ ბრაუზერი ეძებს სურათს.

#  <img src="/day.60.image.png"> 
# აბსოლუტურ - ფესვიდან დაწყებული მისამართი იწყება /-ით რაც ნიშნავს, რომ ძიება ხდება საიტის ფესვიდან. მაგ: სურათი უნდა იდოს მთლიან საიტში მისამართზე /day.60.image.png, ანუ თუ საიტის ფესვია htts://example.com/ მაშინ სურათი იქნება: https://example.com/day.60/image.png ეს კოდი აღარ ეძებს ფაილს html ფაილის მიმდინარე საქალღადეში - იგი ყოველთვის იყენებს საიტის ფესვიდან სრულ გზას.